src/Documents/ВводНачислений/ВводНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачислений</name>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.Графики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ПроизводственныйКалендарь</schedule>
  <scheduleValue>InformationRegister.ПроизводственныйКалендарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ПроизводственныйКалендарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Параметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <recalculations>
    <name>Перерасчет1</name>
  </recalculations>
</mdclass:CalculationRegister>

src/Documents/ВводНачислений/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ПериодДействияНачало;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ПериодДействияКонец;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.БазовыйПериодНачало;
		Движение.БазовыйПериодКонец = ТекСтрокаНачисления.БазовыйПериодКонец;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Параметр = ТекСтрокаНачисления.Параметр;
		Движение.График = ТекСтрокаНачисления.График;
	КонецЦикла; 
	
	Движения.Записать(); 
	
	Расчеты.РассчитатьЗаписи(Ссылка);

КонецПроцедуры
